In [55]:
import pandas as pd
import matplotlib.pyplot as plt

In [180]:
df=pd.read_excel("Agmarknet_Price_And_Arrival_Report_MP.xlsx", header=1) 
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8757 entries, 0 to 8756
Data columns (total 10 columns):
 #   Column                     Non-Null Count  Dtype
---  ------                     --------------  -----
 0   State Name                 8757 non-null   object
 1   District Name              8757 non-null   object
 2   Market Name                8757 non-null   object
 3   Variety                    8757 non-null   object
 4   Group                      8757 non-null   object
 5   Arrivals (Tonnes)          6334 non-null   float64
 6   Min Price (Rs./Quintal)    8757 non-null   int64
 7   Max Price (Rs./Quintal)    8757 non-null   int64
 8   Modal Price (Rs./Quintal)  8757 non-null   int64
 9   Reported Date              8757 non-null   datetime64[ns]
dtypes: datetime64[ns](1), float64(1), int64(3), object(5)
memory usage: 684.3+ KB

In [181]:
df.describe()

,Arrivals (Tonnes),Min Price (Rs./Quintal),Max Price (Rs./Quintal),Modal Price (Rs./Quintal),Reported Date
count,6334.000000,8757.000000,8757.000000,8757.000000,8757
mean,186.754975,1853.939705,2214.913326,2017.356401,2019-09-05 23:18:43.535457280
min,0.010000,0.000000,0.000000,1200.000000,2016-01-01 00:00:00
25%,6.000000,1603.000000,1855.000000,1770.000000,2017-10-14 00:00:00
50%,32.850000,1815.000000,2100.000000,1945.000000,2019-06-11 00:00:00
75%,186.550000,2050.000000,2450.000000,2210.000000,2021-10-05 00:00:00
max,3811.000000,5100.000000,6260.000000,5100.000000,2023-12-30 00:00:00
std,376.871457,363.533303,570.723475,358.642239,NaN

In [182]:
df.head()

,State Name,District Name,Market Name,Variety,Group,Arrivals (Tonnes),Min Price (Rs./Quintal),Max Price (Rs./Quintal),Modal Price (Rs./Quintal),Reported Date
0,Madhya Pradesh,Ashoknagar,Ashoknagar,Sharbati,Cereals,71.25,2880,4665,2230,2023-12-30
1,Madhya Pradesh,Ashoknagar,Ashoknagar,Lokwan,Cereals,210.83,2891,2891,2288,2023-12-29
2,Madhya Pradesh,Ashoknagar,Ashoknagar,Sharbati,Cereals,NaN,3085,4701,2288,2023-12-29
3,Madhya Pradesh,Ashoknagar,Ashoknagar,Other,Cereals,NaN,3150,3150,2288,2023-12-29
4,Madhya Pradesh,Ashoknagar,Ashoknagar,Sharbati,Cereals,165.80,2776,4666,2500,2023-12-28

In [183]:
class Crop_Price_Prediction:

    def __init__(self, df):
        self.df=df

    def drop_columns(self, columns):  #function to drop unwanted columns
        self.df.drop(columns=columns, inplace= True)
        

    def tonne_to_quintal(self, tonne): #function used to convert tonnes to quintel
        
        return tonne*10

    def apply_function(self, col, func):

        self.df[col]=self.df[col].apply(func)

    def variety_to_others(self, var):
        if var=='147 Best' or var=='147 Average':
            return 'Other'
        else:
            return var

    

    def column_rename(self, old, new):
        self.df.rename(columns={
            old:new
        }, inplace=True)


    def null_value_handling(self, col):  #handling null values with mode

        self.df.fillna(method='ffill',inplace=True)

    def date_conversion(self, col):
        
        self.df[col]=pd.to_datetime(self.df[col])
        self.df['Year']=self.df[col].dt.year
        self.df['Month']=self.df[col].dt.month


    def one_hot_encoding(self, col):
        one_hot=pd.get_dummies(self.df[col]).astype(int)
        self.df=pd.concat([self.df, one_hot], axis=1)
        self.df.drop(columns=col, inplace=True)

    def head(self):
        return self.df.head()

    


cp=Crop_Price_Prediction(df)

In [184]:
cp.drop_columns(['State Name', 'District Name']) #State is constant through out the project
cp.drop_columns(['Min Price (Rs./Quintal)', 'Max Price (Rs./Quintal)'])

In [185]:
# cp.null_value_handling('Arrivals (Tonnes)')
df.isna().sum()

Market Name                     0
Variety                         0
Group                           0
Arrivals (Tonnes)            2423
Modal Price (Rs./Quintal)       0
Reported Date                   0
dtype: int64

In [186]:
# cp.apply_function('Arrivals (Tonnes)', cp.tonne_to_quintal)
# cp.column_rename('Arrivals (Tonnes)', 'Arrivals (Quintal)')
cp.null_value_handling('Arrivals (Tonnes)')
df.head()

C:\Users\admin\AppData\Local\Temp\ipykernel_8896\3459130187.py:34: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  self.df.fillna(method='ffill',inplace=True)

,Market Name,Variety,Group,Arrivals (Tonnes),Modal Price (Rs./Quintal),Reported Date
0,Ashoknagar,Sharbati,Cereals,71.25,2230,2023-12-30
1,Ashoknagar,Lokwan,Cereals,210.83,2288,2023-12-29
2,Ashoknagar,Sharbati,Cereals,210.83,2288,2023-12-29
3,Ashoknagar,Other,Cereals,210.83,2288,2023-12-29
4,Ashoknagar,Sharbati,Cereals,165.80,2500,2023-12-28

In [187]:
cp.apply_function('Arrivals (Tonnes)', cp.tonne_to_quintal)
cp.column_rename('Arrivals (Tonnes)', 'Arrivals (Quintal)')

In [188]:
df.head()

,Market Name,Variety,Group,Arrivals (Quintal),Modal Price (Rs./Quintal),Reported Date
0,Ashoknagar,Sharbati,Cereals,712.5,2230,2023-12-30
1,Ashoknagar,Lokwan,Cereals,2108.3,2288,2023-12-29
2,Ashoknagar,Sharbati,Cereals,2108.3,2288,2023-12-29
3,Ashoknagar,Other,Cereals,2108.3,2288,2023-12-29
4,Ashoknagar,Sharbati,Cereals,1658.0,2500,2023-12-28

In [189]:
cp.apply_function('Variety', cp.variety_to_others)

In [190]:
cp.date_conversion('Reported Date')

In [191]:
cp.drop_columns('Reported Date') #conversion done

In [192]:
df['Year'].unique()

array([2023, 2022, 2021, 2020, 2019, 2018, 2017, 2016])

In [193]:
df['Arrivals (Quintal)'].describe()

count     8757.000000
mean      2733.159838
std       4599.335163
min          0.100000
25%        106.000000
50%        856.000000
75%       2929.000000
max      38110.000000
Name: Arrivals (Quintal), dtype: float64

In [194]:
df[df['Arrivals (Quintal)']==38110]

,Market Name,Variety,Group,Arrivals (Quintal),Modal Price (Rs./Quintal),Year,Month
3129,Ashoknagar,Lokwan,Cereals,38110.0,1630,2017,4
3130,Ashoknagar,Sharbati,Cereals,38110.0,2480,2017,4
3131,Ashoknagar,Deshi,Cereals,38110.0,2050,2017,4

In [195]:
df['Group'].unique()

array(['Cereals'], dtype=object)

In [196]:
cp.drop_columns('Group') #since only one group

In [197]:
cp.one_hot_encoding('Market Name')
cp.one_hot_encoding('Variety')
# cp.one_hot_encoding('Group')
cp.head()

,Arrivals (Quintal),Modal Price (Rs./Quintal),Year,Month,Ashoknagar,Chanderi,Isagarh,Mungawali,Piprai,Shadora,Deshi,Lokwan,MP Sharbati,Mill Quality,Other,Sharbati
0,712.5,2230,2023,12,1,0,0,0,0,0,0,0,0,0,0,1
1,2108.3,2288,2023,12,1,0,0,0,0,0,0,1,0,0,0,0
2,2108.3,2288,2023,12,1,0,0,0,0,0,0,0,0,0,0,1
3,2108.3,2288,2023,12,1,0,0,0,0,0,0,0,0,0,1,0
4,1658.0,2500,2023,12,1,0,0,0,0,0,0,0,0,0,0,1

In [198]:
df['Variety'].value_counts()

Variety
Other           2624
Lokwan          2308
Sharbati        1488
Mill Quality    1124
Deshi            902
MP Sharbati      311
Name: count, dtype: int64

,Arrivals (Quintal),Modal Price (Rs./Quintal),Year,Month,Ashoknagar,Chanderi,Isagarh,Mungawali,Piprai,Shadora,Deshi,Lokwan,MP Sharbati,Mill Quality,Other,Sharbati
0,712.5,2230,2023,12,1,0,0,0,0,0,0,0,0,0,0,1
1,2108.3,2288,2023,12,1,0,0,0,0,0,0,1,0,0,0,0
2,2108.3,2288,2023,12,1,0,0,0,0,0,0,0,0,0,0,1
3,2108.3,2288,2023,12,1,0,0,0,0,0,0,0,0,0,1,0
4,1658.0,2500,2023,12,1,0,0,0,0,0,0,0,0,0,0,1